Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.1.68/edc/ATSAML11D14A.PIC
      <edc:AdjustPoint edc:_addr="0xE000EDA4" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0xE000EDC0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MPU_MAIR0" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="Attr0" edc:desc="Attribute of MPU region 0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr1" edc:desc="Attribute of MPU region 1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr2" edc:desc="Attribute of MPU region 2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr3" edc:desc="Attribute of MPU region 3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDC4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MPU_MAIR1" edc:nzwidth="0x20" ltx:memberofperipheral="MPU"/>
      <edc:AdjustPoint edc:_addr="0xE000EDC8" edc:offset="0x28"/>
      <edc:SFRDef edc:_addr="0xE000EDF0" edc:access="-----nnn---nnnnn----------n-nnnn" edc:cname="DHCSR" edc:impl="0x71F002F" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="C_DEBUGEN" edc:desc="Enable Halting debug" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_HALT" edc:desc="Halt processor" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_STEP" edc:desc="Enable single step" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_MASKINTS" edc:desc="Mask PendSV, SysTick and external configurable interrupts" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SNAPSTALL" edc:desc="Snap stall control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="S_REGRDY" edc:desc="Register ready status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_HALT" edc:desc="Halted status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SLEEP" edc:desc="Sleeping status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_LOCKUP" edc:desc="Lockup status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SDE" edc:desc="Secure debug enabled" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="S_RETIRE_ST" edc:desc="Retire sticky status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_RESET_ST" edc:desc="Reset sticky status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_RESTART_ST" edc:desc="Restart sticky status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDF4" edc:access="---------------w---------wwwwwww" edc:cname="DCRSR" edc:impl="0x1007F" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="REGSEL" edc:desc="Register selector" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="REGWnR" edc:desc="Register write/not-read access" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EDF8" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE000EDFC" edc:access="-------n---nnnnn----nnnnnnnn---n" edc:cname="DEMCR" edc:impl="0x11F0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="VC_CORERESET" edc:desc="Core reset Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VC_MMERR" edc:desc="MemManage exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_NOCPERR" edc:desc="UsageFault exception coprocessor access Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_CHKERR" edc:desc="UsageFault exception checking error Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_STATERR" edc:desc="UsageFault exception state information error Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_BUSERR" edc:desc="BusFault exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_INTERR" edc:desc="Excception entry and return faults Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_HARDERR" edc:desc="HardFault exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_SFERR" edc:desc="SecureFault exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MON_EN" edc:desc="DebugMonitor enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_PEND" edc:desc="DebugMonitor pending state" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_STEP" edc:desc="Enable DebugMonitor stepping" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_REQ" edc:desc="DebugMonitor semaphore bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDME" edc:desc="Secure DebugMonitor enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRCENA" edc:desc="Global DWT and ITM features enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EE00" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE000EE04" edc:access="----------------------------nnnn" edc:cname="DAUTHCTRL" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="SPIDENSEL" edc:desc="Secure invasive debug enable select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INTSPIDEN" edc:desc="Internal Secure invasive debug enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPNIDENSEL" edc:desc="Secure non-invasive debug enable select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INTSPNIDEN" edc:desc="Internal Secure non-invasive debug enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EE08" edc:access="--------------nn--------------nn" edc:cname="DSCSR" edc:impl="0x30003" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="SBRSELEN" edc:desc="Secure Banked register select enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SBRSEL" edc:desc="Secure Banked register select" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="CDS" edc:desc="Current domain Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CDSKEY" edc:desc="CDS field write-enable key" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EE0C" edc:offset="0x1A4"/>
      <edc:SFRDef edc:_addr="0xE000EFB0" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="DLAR" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Lock access control" edc:nzwidth="0x20">
              <edc:SFRFieldSemantic edc:cname="UNLOCK" edc:desc="Unlock key value" edc:when="(field &amp; 0xFFFFFFFF) == 0xC5ACCE55"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFB4" edc:access="-----------------------------rrr" edc:cname="DLSR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="SLI" edc:desc="Software Lock implemented" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLK" edc:desc="Software Lock status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="nTT" edc:desc="Not thirty-two bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFB8" edc:access="------------------------rrrr-r-r" edc:cname="DAUTHSTATUS" edc:impl="0xF5" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="NSID" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Non-secure invasive debug prohibited" edc:when="(field &amp; 0x1) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Non-secure invasive debug allowed" edc:when="(field &amp; 0x1) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NSNID" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Non-secure non-invasive debug prohibited" edc:when="(field &amp; 0x1) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Non-secure non-invasive debug allowed" edc:when="(field &amp; 0x1) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOSEC" edc:desc="Security Extension not implemented" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Secure invasive debug prohibited" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Secure invasive debug allowed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SNID" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOSEC" edc:desc="Security Extension not implemented" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Secure non-invasive debug prohibited" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Secure non-invasive debug allowed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFBC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DDEVARCH" edc:mclr="01000111011100000010101000000100" edc:nzwidth="0x20" edc:por="01000111011100000010101000000100" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="ARCHPART" edc:desc="Architecture Part" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="ARCHVER" edc:desc="Architecture Version" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PRESENT" edc:desc="DEVARCH Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARCHITECT" edc:desc="Architect" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EFC0" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0xE000EFCC" edc:access="------------------------rrrrrrrr" edc:cname="DDEVTYPE" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="MAJOR" edc:desc="Major type" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SUB" edc:desc="Sub-type" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
