Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.1.68/edc/ATSAML11D14A.PIC
      <edc:SFRDef edc:_addr="0xE002E404" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR1" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E408" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR2" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E40C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR3" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E410" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR4" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E414" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR5" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E418" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR6" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E41C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR7" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E420" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR8" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E424" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVIC_NS_IPR9" edc:nzwidth="0x20" ltx:memberofperipheral="NVIC_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:desc="Priority of interrupt number 4n+0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:desc="Priority of interrupt number 4n+1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:desc="Priority of interrupt number 4n+2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:desc="Priority of interrupt number 4n+3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
