Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.1.68/edc/ATSAML11D14A.PIC
      <edc:SFRDef edc:_addr="0xE002ED7C" edc:access="rrr-rrrrrrrrrrrr------------rrrr" edc:cname="CTR" edc:impl="0xEFFF000F" edc:nzwidth="0x20" ltx:memberofperipheral="SCB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB_NS">
            <edc:SFRFieldDef edc:cname="IminLine" edc:desc="Instruction cache minimum line length" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DminLine" edc:desc="Data cache minimum line length" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ERG" edc:desc="Exclusives Reservation Granule" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CWG" edc:desc="Cache Write-back Granule" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Format" edc:desc="Cache Type Register format" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No cache type information provided" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Cache type information is provided" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002ED80" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CCSIDR" edc:nzwidth="0x20" ltx:memberofperipheral="SCB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB_NS">
            <edc:SFRFieldDef edc:cname="LineSize" edc:desc="log2(number of words per line) - 2" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="Associativity" edc:desc="Associativity - 1" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="NumSets" edc:desc="Number of sets - 1" edc:nzwidth="0xF"/>
            <edc:SFRFieldDef edc:cname="WA" edc:desc="Write-Allocate" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA" edc:desc="Read-Allocate" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WB" edc:desc="Write-Back" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WT" edc:desc="Write-Through" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002ED84" edc:access="----------------------------nnnn" edc:cname="CSSELR" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="SCB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB_NS">
            <edc:SFRFieldDef edc:cname="InD" edc:desc="Instruction not Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Level" edc:desc="Cache level - 1" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE002ED88" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE002ED90" edc:access="----------------rrrrrrrr-------r" edc:cname="MPU_NS_TYPE" edc:impl="0xFF01" edc:nzwidth="0x20" ltx:memberofperipheral="MPU_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="SEPARATE" edc:desc="Separate instructions and data address regions" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DREGION" edc:desc="Number of MPU data regions" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002ED94" edc:access="-----------------------------nnn" edc:cname="MPU_NS_CTRL" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="MPU_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="MPU enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HFNMIENA" edc:desc="HardFault, NMI enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRIVDEFENA" edc:desc="Privileged default enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002ED98" edc:access="------------------------nnnnnnnn" edc:cname="MPU_NS_RNR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="MPU_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="Selected region number" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002ED9C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MPU_NS_RBAR" edc:nzwidth="0x20" ltx:memberofperipheral="MPU_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="XN" edc:desc="Execute Never" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="Access permissions" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RWPRIV" edc:desc="Read/write by privileged code only" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RWANY" edc:desc="Read/write by any privilege level" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RPRIV" edc:desc="Read-only by privileged code only" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RANY" edc:desc="Read-only by any privilege level" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SH" edc:desc="Shareability" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Non-shareable" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OUTER" edc:desc="Outer shareable" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="INNER" edc:desc="Inner shareable" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="Base address" edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002EDA0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnn-nnnn" edc:cname="MPU_NS_RLAR" edc:impl="0xFFFFFFEF" edc:nzwidth="0x20" ltx:memberofperipheral="MPU_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="EN" edc:desc="Region enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AttrInd" edc:desc="Attribute Index" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LIMIT" edc:desc="Limit address" edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE002EDA4" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0xE002EDC0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MPU_NS_MAIR0" edc:nzwidth="0x20" ltx:memberofperipheral="MPU_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU_NS">
            <edc:SFRFieldDef edc:cname="Attr0" edc:desc="Attribute of MPU region 0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr1" edc:desc="Attribute of MPU region 1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr2" edc:desc="Attribute of MPU region 2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="Attr3" edc:desc="Attribute of MPU region 3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002EDC4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MPU_NS_MAIR1" edc:nzwidth="0x20" ltx:memberofperipheral="MPU_NS"/>
      <edc:AdjustPoint edc:_addr="0xE002EDC8" edc:offset="0x28"/>
      <edc:SFRDef edc:_addr="0xE002EDF0" edc:access="-----nnn---nnnnn----------n-nnnn" edc:cname="DHCSR" edc:impl="0x71F002F" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug_NS">
            <edc:SFRFieldDef edc:cname="C_DEBUGEN" edc:desc="Enable Halting debug" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_HALT" edc:desc="Halt processor" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_STEP" edc:desc="Enable single step" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_MASKINTS" edc:desc="Mask PendSV, SysTick and external configurable interrupts" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SNAPSTALL" edc:desc="Snap stall control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="S_REGRDY" edc:desc="Register ready status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_HALT" edc:desc="Halted status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SLEEP" edc:desc="Sleeping status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_LOCKUP" edc:desc="Lockup status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_SDE" edc:desc="Secure debug enabled" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="S_RETIRE_ST" edc:desc="Retire sticky status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_RESET_ST" edc:desc="Reset sticky status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S_RESTART_ST" edc:desc="Restart sticky status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002EDF4" edc:access="---------------w---------wwwwwww" edc:cname="DCRSR" edc:impl="0x1007F" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug_NS">
            <edc:SFRFieldDef edc:cname="REGSEL" edc:desc="Register selector" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="REGWnR" edc:desc="Register write/not-read access" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE002EDF8" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE002EDFC" edc:access="-------n---nnnnn----nnnnnnnn---n" edc:cname="DEMCR" edc:impl="0x11F0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug_NS">
            <edc:SFRFieldDef edc:cname="VC_CORERESET" edc:desc="Core reset Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VC_MMERR" edc:desc="MemManage exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_NOCPERR" edc:desc="UsageFault exception coprocessor access Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_CHKERR" edc:desc="UsageFault exception checking error Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_STATERR" edc:desc="UsageFault exception state information error Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_BUSERR" edc:desc="BusFault exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_INTERR" edc:desc="Excception entry and return faults Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_HARDERR" edc:desc="HardFault exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_SFERR" edc:desc="SecureFault exception Halting debug vector catch enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MON_EN" edc:desc="DebugMonitor enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_PEND" edc:desc="DebugMonitor pending state" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_STEP" edc:desc="Enable DebugMonitor stepping" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_REQ" edc:desc="DebugMonitor semaphore bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDME" edc:desc="Secure DebugMonitor enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRCENA" edc:desc="Global DWT and ITM features enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE002EE00" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE002EE04" edc:access="----------------------------nnnn" edc:cname="DAUTHCTRL" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug_NS">
            <edc:SFRFieldDef edc:cname="SPIDENSEL" edc:desc="Secure invasive debug enable select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INTSPIDEN" edc:desc="Internal Secure invasive debug enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPNIDENSEL" edc:desc="Secure non-invasive debug enable select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INTSPNIDEN" edc:desc="Internal Secure non-invasive debug enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
