Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.1.68/edc/ATSAML11D14A.PIC
      <edc:SFRDef edc:_addr="0x4000021C" edc:access="------------------nnnnnnnnnn-nnn" edc:cname="INTFLAGC" edc:impl="0x3FF7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:desc="ADC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:desc="TRNG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:desc="OPAMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRAM_" edc:desc="TRAM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000220" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x40000234" edc:access="------------------rrrrrrrrrrrrrr" edc:cname="STATUSA" edc:impl="0x3FFF" edc:mclr="00000000000000001100000000000000" edc:nzwidth="0x20" edc:por="00000000000000001100000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000238" edc:access="----------------------------rrrr" edc:cname="STATUSB" edc:impl="0xF" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="IDAU_" edc:desc="IDAU APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:desc="DMAC APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000023C" edc:access="------------------rrrrrrrrrr-rrr" edc:cname="STATUSC" edc:impl="0x3FF7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:desc="ADC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:desc="TRNG APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:desc="OPAMP APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRAM_" edc:desc="TRAM APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000240" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x40000254" edc:access="------------------rrrrrrrrrrrrrr" edc:cname="NONSECA" edc:impl="0x3FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT Non-Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC Non-Secure" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
