Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.1.68/edc/ATSAML11D14A.PIC
      <edc:AdjustPoint edc:_addr="0x41005002" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41005004" edc:access="-------------nnn----n-nn---nnnn-" edc:cname="CTRLB" edc:impl="0x70B1E" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RWS" edc:desc="NVM Read Wait States" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SLEEPPRM" edc:desc="Power Reduction Mode during Sleep" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="WAKEONACCESS" edc:desc="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="WAKEUPINSTANT" edc:desc="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Auto power reduction disabled." edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FWUP" edc:desc="fast wake-up" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="READMODE" edc:desc="NVMCTRL Read Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_MISS_PENALTY" edc:desc="The NVM Controller (cache system) does not insert wait states on a cache miss. Gives the best system performance." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW_POWER" edc:desc="Reduces power consumption of the cache system, but inserts a wait state each time there is a cache miss. This mode may not be relevant if CPU performance is required, as the application will be stalled and may lead to increase run time." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DETERMINISTIC" edc:desc="The cache system ensures that a cache hit or miss takes the same amount of time, determined by the number of programmed flash wait states. This mode can be used for real-time applications that require deterministic execution timings." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CACHEDIS" edc:desc="Cache Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41005008" edc:access="-------n" edc:cname="CTRLC" edc:impl="0x1" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="MANW" edc:desc="Manual Write" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41005009" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x4100500A" edc:access="------nn" edc:cname="EVCTRL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="AUTOWEI" edc:desc="Auto Write Event Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOWINV" edc:desc="Auto Write Event Polarity Inverted" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100500B" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x4100500C" edc:access="--nnnnnn" edc:cname="INTENCLR" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="NVM Done Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:desc="Programming Error Status Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:desc="Lock Error Status Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:desc="NVM Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEYE" edc:desc="Key Write Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="NS configuration change detected Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100500D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x41005010" edc:access="--nnnnnn" edc:cname="INTENSET" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="NVM Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:desc="Programming Error Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:desc="Lock Error Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:desc="NVM Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEYE" edc:desc="Key Write Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="NS configuration change detected Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41005011" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x41005014" edc:access="--nnnnnn" edc:cname="INTFLAG" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="NVM Done" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:desc="Programming Error Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:desc="Lock Error Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:desc="NVM Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEYE" edc:desc="KEY Write Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="NS configuration change detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41005015" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x41005018" edc:access="-----------rrrrr" edc:cname="STATUS" edc:impl="0x1F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="PRM" edc:desc="Power Reduction Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:desc="NVM Page Buffer Active Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="READY" edc:desc="NVM Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DALFUSE" edc:desc="Debug Access Level Fuse" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DAL0" edc:desc="NO DEBUG" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DAL1" edc:desc="NS DEBUG" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DAL2" edc:desc="FULL DEBUG" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100501A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4100501C" edc:access="--------nn------nnnnnnnnnnnnnnnn" edc:cname="ADDR" edc:impl="0xC0FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="AOFFSET" edc:desc="NVM Address Offset In The Selected Array" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ARRAY" edc:desc="Array Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FLASH" edc:desc="FLASH Array" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATAFLASH" edc:desc="DATA FLASH Array" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NVMROWS" edc:desc="NVM Rows" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41005020" edc:access="nnnnnnnn-----nnn" edc:cname="SULCK" edc:impl="0xFF07" edc:nzwidth="0x10" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="BS" edc:desc="Secure Boot Region" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AS" edc:desc="Secure Application Region" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DS" edc:desc="Data Secure Region" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SLKEY" edc:desc="Write Key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Write Key" edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
