Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.1.68/edc/ATSAML11D14A.PIC
      <edc:SFRDef edc:_addr="0x42000331" edc:access="----nnnn" edc:cname="USER17" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000332" edc:access="----nnnn" edc:cname="USER18" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000333" edc:access="----nnnn" edc:cname="USER19" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000334" edc:access="----nnnn" edc:cname="USER20" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000335" edc:access="----nnnn" edc:cname="USER21" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000336" edc:access="----nnnn" edc:cname="USER22" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000337" edc:offset="0x9D"/>
      <edc:SFRDef edc:_addr="0x420003D4" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420003D5" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420003D6" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420003D7" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x420003D8" edc:access="------------------------nnnnnnnn" edc:cname="NONSECCHAN" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:desc="Non-Secure for Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:desc="Non-Secure for Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:desc="Non-Secure for Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:desc="Non-Secure for Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:desc="Non-Secure for Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:desc="Non-Secure for Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:desc="Non-Secure for Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:desc="Non-Secure for Channel 7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420003DC" edc:access="------------------------nnnnnnnn" edc:cname="NSCHKCHAN" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:desc="Channel 0 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:desc="Channel 1 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:desc="Channel 2 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:desc="Channel 3 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:desc="Channel 4 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:desc="Channel 5 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:desc="Channel 6 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:desc="Channel 7 to be checked as non-secured" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
